export enum NotifierEnum {
    Discord = 'discord',
    Dummy = 'dummy'
};

//----------------------------------------------------------------------------
// 通知を行うオブジェクト
//----------------------------------------------------------------------------
export interface INotifier {
    notify( message: string ): Promise<void>;
}

// ----------------------------------------------------------------------------
// オブジェクトの生成の仕方を隠す (共通のリソースを使い回す場合・毎回作り直す場合があるから)
//----------------------------------------------------------------------------
export interface INotifierProvider {
    provide( param: any ): Promise<INotifier>
}
